
def main():
    tableA = {'J1': {'M1': [4, 3, 1], 'M2': [5, 3, 2]},
              'J2': {'M1': [5, 1, 3], 'M2': [2, 2, 2]},
              'J3': {'M1': [3, 2, 2], 'M2': [6, 1, 1]}}

    tableB = {'j1': {'m1': [2, 0, 1], 'm2': [1, 1, 0]},
              'j2': {'m1': [3, 2, 2], 'm2': [2, 1, 1]},
              'j3': {'m1': [4, 7, 1], 'm2': [4, 1, 5]}}
    
    # 有幾台機器和幾個工作
    mNum = 2
    jobNum = 3

    # 生產線的代完成工作順序
    jobBufA = ['J1', 'J3', 'J2']
    jobBufB = ['j1', 'j2', 'j3']

    # 生產工作必經的機器順序
    macOrdA = ['M1', 'M2']
    macOrdB = ['m1', 'm2']

    ganttA = dict()
    ganttB = dict()

    # 如果還沒排完就繼續排
    # while True :
        # print('*')


main()
